#+TITLE: R&S Chapter 2 Problems
#+AUTHOR: Nooreen Dabbish

#+tblname: matrixcommands
| Operation             | R     | J |
| Matrix Multiplication | A%*%B | A |


*  Problem 2.40
#+BEGIN_SRC R
  Coeff <- matrix(c(1,2,3,1,-1,0,1,0,-1),3,3,byrow=T)
  Aug <- matrix(c(1,2,3,6,1,-1,0,2,1,0,-1,-1),3,4,byrow=T)
  Coeff
  Aug
  identical(Aug, cbind(Coeff,c(6,2,-1)) )
  library(Matrix)
  rankMatrix(Coeff)
  rankMatrix(Aug)
  AugAug <- rbind(Aug, 3*Aug[1,])
  rankMatrix(AugAug)
  AugAug
  AugAugAug <- cbind(AugAug, Aug[2,]-c(rep(1,4)))
  rankMatrix(AugAugAug)
  AugAugAug
  B <- matrix(seq(0,8, by=1), 3,3,byrow=T)
  B%*%Coeff
#+END_SRC

 #+BEGIN_SRC J :exports code
  a=: 3 3 $ 1 2 3 1 _1 0 1 0 _1
  b=: i.3 3
   b 
  NB. I=: =@i.@#
  NB.   I a
  NB. %.a NB. This is the inverse.
  NB. (b%.a) +/.*a
  a
  b +/ . * a NB. This is matrix mult.
  -/ . * b NB. Determinant
#+END_SRC

 #+RESULTS:
 #+begin_example
 0 1 2
 3 4 5
 6 7 8

 1  2  3
 1 _1  0
 1  0 _1

  3 _1 _2
 12  2  4
 21  5 10

 0
#+end_example

